using System.Diagnostics;

namespace Threads
{
    internal class Program
    {
        static void Main(string[] args)
        {
            var notepadThread = new Thread(() =>
            {
                Console.WriteLine("[Поток 1] Запущен");
                Console.WriteLine("[Поток 1] Запуск Блокнота");

                Process notepad = Process.Start("notepad.exe");
                Console.WriteLine("[Поток 1] Блокнот запущен");

                Thread.Sleep(3000);

                Console.WriteLine("[Поток 1] Закрытие Блокнота");

                notepad.CloseMainWindow();

                Console.WriteLine("[Поток 1] Блокнот Закрыт");
                Console.WriteLine("[Поток 1] Завершено");
            });

            ProcessStartInfo cmdStartInfo = new ProcessStartInfo
            {
                FileName = "cmd.exe",
                Arguments = "/c dir",
                RedirectStandardOutput = true,
                RedirectStandardError = true,
                UseShellExecute = false,
                CreateNoWindow = true
            };

            Thread cmdThread = new Thread(() =>
            {
                Console.WriteLine("[Поток 2] Запущен");
                Console.WriteLine("[Поток 2] Запуск Командной строки");

                Process cmd = Process.Start(cmdStartInfo);
                
                string output = cmd.StandardOutput.ReadToEnd();
                cmd.WaitForExit();
                Console.WriteLine("[Поток 2] Результат выполнения: ");
                Console.WriteLine("[Поток 2] " + output);
                

                Console.WriteLine("[Поток 2] Завершено");
            });

            notepadThread.Start();

            cmdThread.Start();

            
        }
    }
}
//Гонка данных
//Гонка данных - это проблема многопоточного программирования, которая возникает когда несколько потоков пытаются обратиться к одному ресурсу,
//при этом итоговый результат этих операций всегда разный, тюк потоки получают этот ресурс в неизвестнои состоянии
/*
 * int counter = 0;
 * 
 * thread1
 * {
 *      for(1000)
 *      {
 *          counter++;
 *      }
 * }
 * thread2
 * {
 *      for(1000)
 *      {
 *          counter++;
 *      }
 * }
 * 
 * Атомарность - неделимоть. Атомарная операция - это операция, которую нельзя поделить, она выполняется с начала и до конца без прерываний.
 * 
 * Видимость изменений - это вторая проблема конкурентности. Она подразумевает неоднозначную видимость изменений между потоками, 
 * когда один поток изменяет данные а другой читает их.
 * 
 * Синхронизация потоков - это процесс который позволяет потокам синхронизировать свою работу через специализированные инструменты.
 * Благодаря этому потоки могут детерминированно работать с одним ресурсом.
 * 
 * Барьер памяти - эо механизм, который ограничивает переурорядовачивание операций памяти
 * Упрощено:
 * операции до барьера не должны быть перемещены после него.
 * операции после барьера не должны быть перемещены до него.
 * изменения становятся видимыми для других потоков согласно правилам памяти.
 * 
 * lock
 * 
 * lock - это примитив синхронизацииЮ который позволяет заблокировать ресурс и сделать его доступным только одному потоку.
 * Синтаксис:
 * lock (obj)
 * {
 *  //потокобезопасный код
 * }
 * где obj - это ссылочный объект
 * 
 * Только один поток может находиться внутри блока lock с этим же объектом блокироки одновременно
 * 
 * Monitor - это базовый механизм блокировки в .NET
 * 
 * Основные методы:
 * Enter(obj);
 * Exit(obj);
 * Wait(obj);
 * Pulse(obj);
 * PulseAll(obj);
 * 
 * Monitor.Enter(obj)
 * 
 * try
 * {
 *  //безопасный код
 * }
 * finally
 * {
 *      Monitor.Exit(obj);
 * }
 * Wait и Pulse
 * позволяют делать более сложную синхронизацию. Они позволяют потокам ждать некоторого условия.
 * 
 * ВАЖНОООООО:
 * Wait выполняется только внутри блокировки
 * Ждёт сигнала Pulse или PulseAll
 * После сигнала пытается снова захватить блокировку
 * 
 * Pulse даёт сигнал ожидающему потоку
 * 
 * Синтаксис:
 * lock(obj)
 * {
 *      while(!condition)
 *      {
 *          Monitor.Wait(obj);
 *      }
 *      Что-то делает
 *      Monitor.Pulse(obj);
 * }
 * 
 * дедлок - это ситуация, когда несколько потоков ждут друг друга и не могут продолжить потока.
 * 
 * Лайвлок - похож на дедлок но потоки не заблокированы. Они активны, пытаются что то сделать но не могут продвинуться.
 * 
 * голодание потоков - это ситуация когда поток не может получить доступ к ресурсу, потому что другие потоки молучают его раньше.
 */